slorquet/slos/arch/armv7m/stm32f1/bits/stm32f1_periphs.h
#ifndef _ARCH_ARMV7M_STM32F1_BITS_STM32F1_PERIPHS_H_
#define _ARCH_ARMV7M_STM32F1_BITS_STM32F1_PERIPHS_H_

/* APB1 */

#define STM32F1_REGBASE_TIM2     0x40000000
#define STM32F1_REGBASE_TIM3     0x40000400
#define STM32F1_REGBASE_TIM4     0x40000800
#define STM32F1_REGBASE_TIM5     0x40000C00
#define STM32F1_REGBASE_TIM6     0x40001000
#define STM32F1_REGBASE_TIM7     0x40001400
#define STM32F1_REGBASE_TIM12    0x40001800
#define STM32F1_REGBASE_TIM13    0x40001C00
#define STM32F1_REGBASE_TIM14    0x40002000
#define STM32F1_REGBASE_RTC      0x40002800
#define STM32F1_REGBASE_WWDG     0x40002C00
#define STM32F1_REGBASE_IWDG     0x40003000
#define STM32F1_REGBASE_SPI2     0x40003800
#define STM32F1_REGBASE_SPI3     0x40003C00
#define STM32F1_REGBASE_USART2   0x40004400
#define STM32F1_REGBASE_USART3   0x40004800
#define STM32F1_REGBASE_UART4    0x40004C00
#define STM32F1_REGBASE_UART5    0x40005000
#define STM32F1_REGBASE_I2C1     0x40005400
#define STM32F1_REGBASE_I2C2     0x40005800
#define STM32F1_REGBASE_USBFS    0x40005C00
#define STM32F1_REGBASE_SHRAM    0x40006000
#define STM32F1_REGBASE_CAN1     0x40006400
#define STM32F1_REGBASE_CAN2     0x40006800
#define STM32F1_REGBASE_BKP      0x40006C00
#define STM32F1_REGBASE_PWR      0x40007000
#define STM32F1_REGBASE_DAC      0x40007400

/* APB2 */
#define STM32F1_REGBASE_AFIO     0x40010000
#define STM32F1_REGBASE_EXTI     0x40010400
#define STM32F1_REGBASE_GPIOA    0x40010800
#define STM32F1_REGBASE_GPIOB    0x40010C00
#define STM32F1_REGBASE_GPIOC    0x40011000
#define STM32F1_REGBASE_GPIOD    0x40011400
#define STM32F1_REGBASE_GPIOE    0x40011800
#define STM32F1_REGBASE_GPIOF    0x40011C00
#define STM32F1_REGBASE_GPIOG    0x40012000
#define STM32F1_REGBASE_ADC1     0x40012400
#define STM32F1_REGBASE_ADC2     0x40012800
#define STM32F1_REGBASE_TIM1     0x40012C00
#define STM32F1_REGBASE_SPI1     0x40013000
#define STM32F1_REGBASE_TIM8     0x40013400
#define STM32F1_REGBASE_USART1   0x40013800
#define STM32F1_REGBASE_ADC3     0x40013C00
#define STM32F1_REGBASE_TIM9     0x40014C00
#define STM32F1_REGBASE_TIM10    0x40015000
#define STM32F1_REGBASE_TIM11    0x40015400

/* AHB */
#define STM32F1_REGBASE_SDIO     0x40018000
#define STM32F1_REGBASE_DMA1     0x40020000
#define STM32F1_REGBASE_DMA2     0x40020400
#define STM32F1_REGBASE_RCC      0x40021000
#define STM32F1_REGBASE_FLASH    0x40022000
#define STM32F1_REGBASE_CRC      0x40023000
#define STM32F1_REGBASE_ETH      0x40028000
#define STM32F1_REGBASE_OTGFS    0x50000000
#define STM32F1_REGBASE_FSMC     0xA0000000


#endif /* _ARCH_ARMV7M_STM32F1_BITS_STM32F1_PERIPHS_H_ */

